sterentev/atdf-device-asm-include/inc/ATmega644RFR2.inc
; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit

; ----------	Register UCSR0A bits		------------------------
;.equ	RXC0		= 7		; 0x80 - USART Receive Complete
;.equ	TXC0		= 6		; 0x40 - USART Transmit Complete
;.equ	UDRE0		= 5		; 0x20 - USART Data Register Empty

; ----------	Register UCSR0B bits		------------------------
;.equ	RXCIE0		= 7		; 0x80 - RX Complete Interrupt Enable
;.equ	TXCIE0		= 6		; 0x40 - TX Complete Interrupt Enable
;.equ	UDRIE0		= 5		; 0x20 - USART Data Register Empty Interrupt Enable
;.equ	RXEN0		= 4		; 0x10 - Receiver Enable
;.equ	TXEN0		= 3		; 0x08 - Transmitter Enable

; ----------	Register UCSR0C bits		------------------------
.equ	UDORD0		= 2		; 0x04 - Data Order
.equ	UCPHA0		= 1		; 0x02 - Clock Phase
;.equ	UCPOL0		= 0		; 0x01 - Clock Polarity

; ----------	Register UCSR1A bits		------------------------
;.equ	RXC1		= 7		; 0x80 - USART Receive Complete
;.equ	TXC1		= 6		; 0x40 - USART Transmit Complete
;.equ	UDRE1		= 5		; 0x20 - USART Data Register Empty

; ----------	Register UCSR1B bits		------------------------
;.equ	RXCIE1		= 7		; 0x80 - RX Complete Interrupt Enable
;.equ	TXCIE1		= 6		; 0x40 - TX Complete Interrupt Enable
;.equ	UDRIE1		= 5		; 0x20 - USART Data Register Empty Interrupt Enable
;.equ	RXEN1		= 4		; 0x10 - Receiver Enable
;.equ	TXEN1		= 3		; 0x08 - Transmitter Enable

; ----------	Register UCSR1C bits		------------------------
.equ	UDORD1		= 2		; 0x04 - Data Order
.equ	UCPHA1		= 1		; 0x02 - Clock Phase
;.equ	UCPOL1		= 0		; 0x01 - Clock Polarity



; ====	TC8 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR0B bits		------------------------
.equ	FOC0A		= 7		; 0x80 - Force Output Compare A
.equ	FOC0B		= 6		; 0x40 - Force Output Compare B
.equ	TCCR0B_Res_MASK	= 0x30		;      - Reserved Bit (2 bits)
.equ	TCCR0B_Res0	= 4		;          TCCR0B_Res BIT0 position
.equ	WGM02		= 3		; 0x08 - 
.equ	CS0_MASK	= 0x07		;      - Clock Select (3 bits)
.equ	CS00		= 0		;          CS0 BIT0 position
; ::::  CS0	:::: bitfield values
;			0x00		; No clock source (Timer/Counter0 stopped)
;			0x01		; clk_IO/1 (no prescaling)
;			0x02		; clk_IO/8 (from prescaler)
;			0x03		; clk_IO/64 (from prescaler)
;			0x04		; clk_IO/256 (from prescaler)
;			0x05		; clk_IO/1024 (from prescaler)
;			0x06		; External clock source on T0 pin, clock on falling edge
;			0x07		; External clock source on T0 pin, clock on rising edge

; ----------	Register TCCR0A bits		------------------------
.equ	COM0A_MASK	= 0xC0		;      - Compare Match Output A Mode (2 bits)
.equ	COM0A0		= 6		;          COM0A BIT0 position
.equ	COM0B_MASK	= 0x30		;      - Compare Match Output B Mode (2 bits)
.equ	COM0B0		= 4		;          COM0B BIT0 position
.equ	TCCR0A_Res_MASK	= 0x0C		;      - Reserved Bit (2 bits)
.equ	TCCR0A_Res0	= 2		;          TCCR0A_Res BIT0 position
.equ	WGM0_MASK	= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	WGM00		= 0		;          WGM0 BIT0 position
; ::::  COM0A	:::: bitfield values
;			0x00		; Normal port operation, OC0A disconnected
;			0x40		; Toggle OC0A on Compare Match
;			0x80		; Clear OC0A on Compare Match
;			0xC0		; Set OC0A on Compare Match
; ::::  COM0B	:::: bitfield values
;			0x00		; Normal port operation, OC0B disconnected
;			0x10		; Toggle OC0B on Compare Match
;			0x20		; Clear OC0B on Compare Match
;			0x30		; Set OC0B on Compare Match
; ::::  WGM0	>>>> This is a part of TC0_WGM_BITF enum (see complete values list below)

; ----------	Register TIMSK0 bits		------------------------
.equ	OCIE0B		= 2		; 0x04 - Timer/Counter0 Output Compare Match B Interrupt Enable
.equ	OCIE0A		= 1		; 0x02 - Timer/Counter0 Output Compare Match A Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Timer/Counter0 Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	OCF0B		= 2		; 0x04 - Timer/Counter0 Output Compare B Match Flag
.equ	OCF0A		= 1		; 0x02 - Timer/Counter0 Output Compare A Match Flag
.equ	TOV0		= 0		; 0x01 - Timer/Counter0 Overflow Flag

; ----------	Register GTCCR bits		------------------------
.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSRASY		= 1		; 0x02 - Prescaler Reset Timer/Counter2
.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset for Synchronous Timer/Counters



; ====	TC8_ASYNC MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register TIMSK2 bits		------------------------
.equ	TIMSK2_Res_MASK	= 0xF8		;      - Reserved Bit (5 bits)
.equ	TIMSK2_Res0	= 3		;          TIMSK2_Res BIT0 position
.equ	OCIE2B		= 2		; 0x04 - Timer/Counter2 Output Compare Match B Interrupt Enable
.equ	OCIE2A		= 1		; 0x02 - Timer/Counter2 Output Compare Match A Interrupt Enable
.equ	TOIE2		= 0		; 0x01 - Timer/Counter2 Overflow Interrupt Enable

; ----------	Register TIFR2 bits		------------------------
.equ	TIFR2_Res_MASK	= 0xF8		;      - Reserved Bit (5 bits)
.equ	TIFR2_Res0	= 3		;          TIFR2_Res BIT0 position
.equ	OCF2B		= 2		; 0x04 - Output Compare Flag 2 B
.equ	OCF2A		= 1		; 0x02 - Output Compare Flag 2 A
.equ	TOV2		= 0		; 0x01 - Timer/Counter2 Overflow Flag

; ----------	Register TCCR2A bits		------------------------
.equ	COM2A_MASK	= 0xC0		;      - Compare Match Output A Mode (2 bits)
.equ	COM2A0		= 6		;          COM2A BIT0 position
.equ	COM2B_MASK	= 0x30		;      - Compare Match Output B Mode (2 bits)
.equ	COM2B0		= 4		;          COM2B BIT0 position
.equ	WGM2_MASK	= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	WGM20		= 0		;          WGM2 BIT0 position
; ::::  COM2A	:::: bitfield values
;			0x00		; Normal port operation, OC2A disconnected
;			0x40		; Toggle OC2A on Compare Match
;			0x80		; Clear OC2A on Compare Match
;			0xC0		; Set OC2A on Compare Match
; ::::  COM2B	:::: bitfield values
;			0x00		; Normal port operation, OC2B disconnected
;			0x10		; Toggle OC2B on Compare Match
;			0x20		; Clear OC2B on Compare Match
;			0x30		; Set OC2B on Compare Match
; ::::  WGM2	>>>> This is a part of TC0_WGM_BITF enum (see complete values list below)

; ----------	Register TCCR2B bits		------------------------
.equ	FOC2A		= 7		; 0x80 - Force Output Compare A
.equ	FOC2B		= 6		; 0x40 - Force Output Compare B
.equ	WGM22		= 3		; 0x08 - Waveform Generation Mode
.equ	CS2_MASK	= 0x07		;      - Clock Select (3 bits)
.equ	CS20		= 0		;          CS2 BIT0 position
; ::::  CS2	:::: bitfield values
;			0x00		; No clock source (Timer/Counter2 stopped)
;			0x01		; clk_T2S/1 (no prescaling)
;			0x02		; clk_T2S/8 (from prescaler)
;			0x03		; clk_T2S/32 (from prescaler)
;			0x04		; clk_T2S/64 (from prescaler)
;			0x05		; clk_T2S/128 (from prescaler)
;			0x06		; clk_T2S/256 (from prescaler)
;			0x07		; clk_T2S/1024 (from prescaler)

