sterentev/atdf-device-asm-include/inc/ATmega644RFR2.inc
; ====	JTAG MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register OCDR bits		------------------------
.equ	OCDR_MASK	= 0xFF		;      - On-Chip Debug Register Data (8 bits)
.equ	OCDR0		= 0		;          OCDR BIT0 position
; ::::  OCDR	:::: bitfield values
;			0x00		; Refer to the debugger documentation for further information on how to use this register.

; ----------	Register MCUCR bits		------------------------
.equ	JTD		= 7		; 0x80 - JTAG Interface Disable

; ----------	Register MCUSR bits		------------------------
.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC3_MASK	= 0xC0		;      - External Interrupt 3 Sense Control Bit (2 bits)
.equ	ISC30		= 6		;          ISC3 BIT0 position
.equ	ISC2_MASK	= 0x30		;      - External Interrupt 2 Sense Control Bit (2 bits)
.equ	ISC20		= 4		;          ISC2 BIT0 position
.equ	ISC1_MASK	= 0x0C		;      - External Interrupt 1 Sense Control Bit (2 bits)
.equ	ISC10		= 2		;          ISC1 BIT0 position
.equ	ISC0_MASK	= 0x03		;      - External Interrupt 0 Sense Control Bit (2 bits)
.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  ISC3	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x40		; Any edge of INTn generates asynchronously an interrupt request.
;			0x80		; The falling edge of INTn generates asynchronously an interrupt request.
;			0xC0		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC2	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x10		; Any edge of INTn generates asynchronously an interrupt request.
;			0x20		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x30		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC1	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x04		; Any edge of INTn generates asynchronously an interrupt request.
;			0x08		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x0C		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC0	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x01		; Any edge of INTn generates asynchronously an interrupt request.
;			0x02		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x03		; The rising edge of INTn generates asynchronously an interrupt request.

; ----------	Register EICRB bits		------------------------
.equ	ISC7_MASK	= 0xC0		;      - External Interrupt 7 Sense Control Bit (2 bits)
.equ	ISC70		= 6		;          ISC7 BIT0 position
.equ	ISC6_MASK	= 0x30		;      - External Interrupt 6 Sense Control Bit (2 bits)
.equ	ISC60		= 4		;          ISC6 BIT0 position
.equ	ISC5_MASK	= 0x0C		;      - External Interrupt 5 Sense Control Bit (2 bits)
.equ	ISC50		= 2		;          ISC5 BIT0 position
.equ	ISC4_MASK	= 0x03		;      - External Interrupt 4 Sense Control Bit (2 bits)
.equ	ISC40		= 0		;          ISC4 BIT0 position
; ::::  ISC7	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x40		; Any edge of INTn generates asynchronously an interrupt request.
;			0x80		; The falling edge of INTn generates asynchronously an interrupt request.
;			0xC0		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC6	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x10		; Any edge of INTn generates asynchronously an interrupt request.
;			0x20		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x30		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC5	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x04		; Any edge of INTn generates asynchronously an interrupt request.
;			0x08		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x0C		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC4	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x01		; Any edge of INTn generates asynchronously an interrupt request.
;			0x02		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x03		; The rising edge of INTn generates asynchronously an interrupt request.

; ----------	Register EIMSK bits		------------------------
.equ	INT_MASK	= 0xFF		;      - External Interrupt Request Enable (8 bits)
.equ	INT0		= 0		;          INT BIT0 position
; ::::  INT	:::: bitfield values
;			0x00		; All external pin interrupts are disabled.
;			0xFF		; All external pin interrupts are enabled.

; ----------	Register EIFR bits		------------------------
.equ	INTF_MASK	= 0xFF		;      - External Interrupt Flag (8 bits)
.equ	INTF0		= 0		;          INTF BIT0 position
; ::::  INTF	:::: bitfield values
;			0x00		; No edge or logic change on INT7:0 occurred.
;			0x01		; A edge or logic change on INT0 occurred and triggered an interrupt request.
;			0x02		; ...
;			0x80		; A edge or logic change on INT7 occurred and triggered an interrupt request.

; ----------	Register PCMSK2 bits		------------------------
.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Mask (8 bits)
.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCMSK1 bits		------------------------
;.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Mask (8 bits)
;.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCMSK0 bits		------------------------
;.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Mask (8 bits)
;.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCIFR bits		------------------------
.equ	PCIFR_Res_MASK	= 0xF8		;      - Reserved Bit (5 bits)
.equ	PCIFR_Res0	= 3		;          PCIFR_Res BIT0 position
.equ	PCIF_MASK	= 0x07		;      - Pin Change Interrupt Flags (3 bits)
.equ	PCIF0		= 0		;          PCIF BIT0 position

